"""
control_command.py
Містить структуру команди керування роботом.
Створюється модулем логіки або контролером та передається далі в robot-модуль для виконання.
"""

from dataclasses import dataclass


@dataclass
class ControlCommand:
    # Лінійна швидкість по осі X.
    # Зазвичай відповідає за рух вперед або назад.
    vx: float

    # Лінійна швидкість по осі Y.
    # Використовується, якщо платформа підтримує боковий рух.
    vy: float

    # Кутова швидкість обертання навколо вертикальної осі.
    # Використовується для повороту робота.
    wz: float

    # Прапорець примусової зупинки.
    # Якщо True, команда інтерпретується як команда stop.
    stop: bool = False